# parameters
nc: 80  # number of classes
depth_multiple: 0.33 #0.33  0.67# model depth multiple
width_multiple: 0.5 #0.50  0.75# layer channel multiple
# anchors
anchors:
### Ori value.
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326] #P5/32
# YOLOv5 backbone
backbone:
   [[-1, 1, Conv, [64, 6, 2, 2]],       # 0 320,320,32
   [-1, 1, Conv, [128, 3, 2]],          # 1-P2/4   # [..., [Output channel, kernel, strides]]   k=3,s=2,p=1;[64,160,160]
   [-1, 3, C3, [128]],                  # 2   [64,160,160]
   [-1, 1, Conv, [256, 3, 2]],          # 3-P3/8    [128,80,80]
   [-1, 9, C3, [256]],                  # 4         [128,80,80]
   [-1, 1, Conv, [512, 3, 2]],          # 5-P4/16    [256,40,40]
   [-1, 9, C3, [512]],                  # 6        [256,40,40]
   [-1, 1, Conv, [1024, 3, 2]],         # 7-P5/32     [512,20,20]
   [-1, 3, C3, [1024, False]],          # 8
   [-1, 1, SPP, [1024, [5, 7,13]]],     # 9  [512,20,20]
   [-1, 1, NonLocal, [1024]],           # 10
   [-1, 1, SpatialTransformer, [1024]], # 11
  ]
head:
  [[-1, 1, Conv, [512, 1, 1]],                  # 12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 13
   [[-1, 6], 1, Concat, [1]],                   # 14 cat backbone P4
   [-1, 3, C3, [512, False]],                   # 15

   [-1, 1, Conv, [256, 1, 1]],                  # 16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 17
   [-1,1,PSAModule,[256]],                      # 18
   [[-1, 4], 1, Concat, [1]],                   # 19 cat backbone P3
   [-1, 3, C3, [256, False]],                   # 20 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],                  # 21
   [[-1, 16], 1, Concat, [1]],                  # 22 cat head P4
   [-1,1,PSAModule,[256]],                      # 23
   [-1, 3, C3, [512, False]],                   # 24 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],                  # 25
   [[-1, 12], 1, Concat, [1]],                  # 26 cat head P5
   [-1,1,PSAModule,[512]],                      # 27
   [-1, 3, C3, [1024, False]],                  # 28 (P5/32-large)

   [[20, 24, 28], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]